import datetime


path = float(input('Введіть магнітуду(ML):'))

if path <= 0 :
	print('Землетрусу немаэ')
elif path <= 2 :
	print('Мікро \nМікроземлетруси, не відчуваються.')
elif path >= 2.0 and path <= 3.0 :
	print('Дуже слабкий \nЯк правило не відчуваються, але реєструються.')
elif path >= 3.0 and path <= 4.0 :
	print('Слабкий \nЧасто відчуваються, дуже рідко завдають шкоди.')
elif path >= 4.0 and path <= 5.0 :
	print('Легкий\nВідчутне тремтіння речей всередині будинків, значна шкода малоймовірна.')
elif path >= 5.0 and path <= 6.0 :
	print('Помірний \nМоже завдати значної шкоди старим та погано сконструйованим будівлям на незначній території.')
elif path >= 6.0 and path <= 7.0 :
	print('Сильний \nМоже спричинити руйнацію на території до 150 км довжиною/шириною в населених регіонах.')
elif path >= 7.0 and path <= 8.0 :
	print('Дуже сильний \nЗначна руйнація на значній території.')
elif path >= 8.0 and path <= 10.0 :
	print('Великий \nСерйозна руйнація на територіях довжиною/шириною в сотні кілометрів.')
elif path >= 10.0 :
	print('Рідкісно великий')



def printTimeStamp(name):
    print('Автори програми: ' + name)
    print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp("Diakov and Zanko")